# ExtrudedRoofCutBySketch Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoofFailures..::..ExtrudedRoofCutBySketch Property
BuiltInFailures..::..RoofFailures Class See Also
---
Entire extruded Roof is cut by cut Sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ExtrudedRoofCutBySketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExtrudedRoofCutBySketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ExtrudedRoofCutBySketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoofFailures Class
Autodesk.Revit.DB Namespace